# =============================================================================
# Brewfile — Declarative package list
# Run: brew bundle --file=Brewfile
# =============================================================================

# ── Taps ──────────────────────────────────────────────────────────────────────
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

# ── CLI Essentials ────────────────────────────────────────────────────────────
brew "git"              # version control
brew "gh"               # GitHub CLI
brew "curl"             # HTTP client
brew "wget"             # file downloader
brew "jq"               # JSON processor
brew "yq"               # YAML processor
brew "fzf"              # fuzzy finder
brew "ripgrep"          # fast grep (rg)
brew "fd"               # fast find
brew "bat"              # cat with syntax highlighting
brew "eza"              # modern ls replacement
brew "delta"            # better git diffs
brew "tree"             # directory tree viewer
brew "zoxide"           # smarter cd
brew "tldr"             # simplified man pages
brew "htop"             # process monitor
brew "bottom"           # system resource monitor (btm)
brew "hyperfine"        # benchmarking tool
brew "gum"              # shell script UI components
brew "age"              # encryption tool

# ── Dev Tools ─────────────────────────────────────────────────────────────────
brew "mise"             # runtime version manager (node, python, ruby, etc.)
brew "direnv"           # per-directory env vars
brew "git-lfs"          # large file storage
brew "pre-commit"       # git hook framework
brew "act"              # run GitHub Actions locally

# ── Networking ────────────────────────────────────────────────────────────────
brew "nmap"             # network scanner
brew "httpie"           # friendly HTTP client
brew "mtr"              # traceroute + ping
brew "dog"              # DNS lookup tool

# ── Shell ─────────────────────────────────────────────────────────────────────
brew "zsh"
brew "zsh-completions"
brew "starship"         # prompt (optional — OMZ themes take priority)

# ── macOS Utilities ───────────────────────────────────────────────────────────
brew "mas"              # Mac App Store CLI
brew "dockutil"         # manage Dock items from CLI
brew "switchaudio-osx"  # switch audio devices
brew "pinentry-mac"     # GPG PIN entry

# ── Apps (Casks) ──────────────────────────────────────────────────────────────
cask "visual-studio-code"
cask "iterm2"
cask "raycast"          # Spotlight replacement + AI
cask "1password"
cask "1password-cli"    # op CLI for secrets
cask "rectangle"        # window management
cask "arc"              # browser
cask "slack"
cask "zoom"
cask "notion"
cask "obsidian"
cask "cleanmymac"
cask "istat-menus"      # system stats in menu bar
cask "tableplus"        # DB GUI
cask "proxyman"         # HTTP proxy / debugger

# ── Fonts ─────────────────────────────────────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"

# ── Mac App Store ─────────────────────────────────────────────────────────────
# mas "Amphetamine", id: 937984704       # keep Mac awake
# mas "Hand Mirror", id: 1502839586      # quick camera check
# (uncomment the ones you use, add your own)
