# =============================================================================
# Brewfile
# Install everything: brew bundle --file=Brewfile
# =============================================================================

# ── CLI Essentials ────────────────────────────────────────────────────────────
brew "git"              # version control
brew "gh"               # GitHub CLI — create PRs, manage issues from terminal
brew "curl"             # HTTP requests
brew "wget"             # file downloads
brew "jq"               # parse and query JSON
brew "yq"               # parse and query YAML
brew "fzf"              # fuzzy search — used by gpr and other bin scripts
brew "ripgrep"          # fast text search across files (rg)
brew "fd"               # fast file finder
brew "bat"              # better cat with syntax highlighting
brew "eza"              # better ls with icons and git status
brew "delta"            # better git diffs with syntax highlighting
brew "tree"             # show folder structure as a tree
brew "zoxide"           # smarter cd — jumps to frecent directories
brew "gum"              # pretty prompts and spinners for shell scripts
brew "age"              # simple file encryption

# ── Developer Tools ───────────────────────────────────────────────────────────
brew "mise"             # manage Node, Python, Ruby versions (replaces nvm, pyenv)
brew "direnv"           # load .env files automatically per project folder
brew "git-lfs"          # store large files (videos, datasets) in git repos
brew "lazygit"          # terminal UI for git — visual branch/commit management
brew "pre-commit"       # run checks automatically before every git commit
brew "act"              # run GitHub Actions locally before pushing
brew "mkcert"           # create trusted HTTPS certificates for local development
brew "grpcurl"          # test gRPC APIs from the terminal (like curl for gRPC)

# ── AI Tools ──────────────────────────────────────────────────────────────────
brew "ollama"           # run AI models locally (Llama, Mistral, etc.)

# ── API & Networking ──────────────────────────────────────────────────────────
brew "httpie"           # human-friendly HTTP client (easier than curl)
brew "nmap"             # network scanner — useful for debugging connectivity

# ── Shell ─────────────────────────────────────────────────────────────────────
brew "zsh"
brew "zsh-completions"

# ── macOS Utilities ───────────────────────────────────────────────────────────
brew "mas"              # install apps from the Mac App Store via terminal
brew "dockutil"         # manage Dock items from a script
brew "switchaudio-osx"  # switch audio output devices from terminal

# ── Apps ──────────────────────────────────────────────────────────────────────

# Editors & Terminals
cask "visual-studio-code"           # primary editor

# Design & Product
cask "figma"                        # UI/UX design — essential for product work
cask "loom"                         # quick screen recordings for async comms and docs

# AI
cask "claude"                       # Claude desktop app
cask "claude-code"                  # Claude Code — agentic coding in the terminal
cask "chatgpt"                      # ChatGPT desktop app

# Communication & Productivity
cask "slack"
cask "notion"
cask "obsidian"                     # local-first notes and second brain

# Database
cask "dbeaver-community"            # universal DB GUI — works with Postgres, MySQL, SQLite, and more

# ── Fonts ─────────────────────────────────────────────────────────────────────
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"

# ── Mac App Store ─────────────────────────────────────────────────────────────
# Uncomment what you use:
# mas "Amphetamine", id: 937984704      # keep Mac awake during long tasks
# mas "Hand Mirror", id: 1502839586     # quick webcam check before calls
# mas "Lungo", id: 1263070803           # lightweight alternative to Amphetamine
